<?php

DEFINE("INTRO","こんにちは 私は");
DEFINE("NAME","リガー・バンスです。")
DEFINE("COMPANY","ソフトウェアエンジニア / ラネックス法人");

DEFINE("SUMMARY","概要");
DEFINE("SUMMARY_DESC","情報工学専門して大学を卒業した。<br/><br/>
<b>どうやってロックスター開発者になられるのですか？</b><br/><br/>
自分の書いたコードを批評できる、またはあった問題を解決できる方法を教えられる できるだけ最もいい師を見つけて。その師の意見に正論で挑戦して、議論に勝つようになってきた時かなりいい水準を果たしたことを分かれます。<br/>
解決している問題の難しさや範囲をいつも上がりなさい。多くの人は２０年間の経験を持っていません。ただ１年間の経験を２０度も重ねているたけです。その人のようにならないでください。<br/>
文書化や良い方法、関数の名、全面的なソフトウェアテストをかくなどのことを大切にしなさい。書いたコードはプロフェッショナルに見えるべきです。<br/>
構成要素を分かるため、すべての標準ライブラリをスキャンしなさい。特定のライブラリを初めて使うとき、そのライブラリを後ろや前の両方から覚えなさい。知っている言語で書かれたのか、またはソースコードは利用可能であるのかと確認してください。何か完全に分からないことがあれば、それを新しいことを学ぶチャンスにして、いつも博識を求めなさい。<br/>
できるだけ一番良いの統合開発環境（IDE）を使いなさい。統合開発環境（IDE）を後ろや前の両方から覚えなさい。良い統合開発環境（IDE）はあなたの速度をすごく上げてくれます。<br/>
難しい仕事を挑む時、例えば前に使ったことはないSOAP/XMLで仕事をするべきの時、コードを書き始める前に広範囲なリサーチすればいい。インターネットや自分のライブラリで検索してみて：他の人が使われている最新と最高な解決方法は何だろうか。よく考えて進みなさい。<br/>
忘れないでください：あなたは他の人のためコードを書きます。いつも得意先に連絡を取りなさい。彼らの 期待に添って、専門知識を発揮しなさい。社会相をいつも覚えておいてください。<br/>
話したことを信じてください、これらのヒントは助けてあげます。;)<br/>
--------------------------------------------------------------------------------");
DEFINE("SUMMARY_DESCS1","アンドロイドのため健康管理のアプリケーションを開発した、開発する際にはバージョン管理システムとしてアパッチ・サブバージョン（SVN）を、依存性の注入の単純性をアンドロイドにを達するRoboGuiceのフレームワークを使った、エスキューライト（SQLite）にDAO マネージャーとSOAP。");
DEFINE("SUMMARY_DESCS2","Java デスクトップ・アプリケーションの開発 − マッピング・アプリケーション開発した、開発する際にはバージョン管理システムとしてアパッチ・サブバージョン（SVN）を使った、グーグル マップ、アプリケーションプログラミングインタフェース（API）");
DEFINE("SUMMARY_DESCS3","アンドロイドの開発、韓国のためのニュース・アプリケーションを開発した、Eラーニング・アプリケーション、人工無脳・アプリケーション。");
DEFINE("SUMMARY_DESCS4","ソーシャルメディア・アプリケーションの開発、ピー・エイチ・ピー、ゼンド、アイオーエス。");
DEFINE("SUMMARY_DESCS5","販売時点情報管理（ POS ）のようアンドロイドのカスタマイズ （カスタムハードウェア、ソフトウェア組み込みオペレーティングシステム）");
DEFINE("SUMMARY_DESCS6","ソフトウェア技術者 − 電話、デスクトップ、モビール、ウェブアプリケーション。");

DEFINE("PORTFOLIO","ポートフォリオ");
DEFINE("PORTFOLIO_1","顧客管理システム(Customer Management System)(C#)");
DEFINE("PORTFOLIO_1_DESC","デスクトップアプリケーション、コンテンツマネージメントシステム（CMS）");
DEFINE("PORTFOLIO_2","eHealth Mobile (イヘルツ・モービル)(Android)");
DEFINE("PORTFOLIO_2_DESC","医療スタッフと患者のためのアプリケーション、医者の予約や予定表、時間割りを生成する。");
DEFINE("PORTFOLIO_3","SanMiguel Territories（サンミゲルテリトリーズ）(J2SE)");
DEFINE("PORTFOLIO_3_DESC","グーグルマップを使ってビジネスの領地を表すマッピングアプリケーションツール");
DEFINE("PORTFOLIO_4","Let's Learn English! （レッツレーヌイギリス）(Android)");
DEFINE("PORTFOLIO_4_DESC","英語、韓国語、中国語で翻訳、語彙、ディクテーション、録音、通訳、インタビュータイプのビデオ録画ができるE・ラーニング・アプリケーション。");
DEFINE("PORTFOLIO_5","Talky Bird （トリキーバーディ）(Android/PHP)");
DEFINE("PORTFOLIO_5_DESC","アンドロイドとアイオーエスのためピー・エイチ・ピー （PHP）、エーアイエムエル（AIML）、ジェイソン（JSON）を使う人工無脳・アプリケーション。");
DEFINE("PORTFOLIO_6","KoreaTimes（コリアタイムズ）(Android)");
DEFINE("PORTFOLIO_6_DESC","韓国のためのモビールニュース・アプリケーション");

DEFINE("TIMELINE","タイムライン");
DEFINE("TIMELINE_1_CO","株式会社ラネックス");
DEFINE("TIMELINE_1_POS","ソフトウェアエンジニア");
DEFINE("TIMELINE_1_YR","2014.10 - 現在");
DEFINE("TIMELINE_2_CO","グローバル・フュージョン");
DEFINE("TIMELINE_2_POS","アンドロイド開発者");
DEFINE("TIMELINE_2_YR","2013.10 - 2014.10");
DEFINE("TIMELINE_3_CO","ヤンバ");
DEFINE("TIMELINE_3_POS","アンドロイド開発者");
DEFINE("TIMELINE_3_YR","2013.6 - 2014.7");
DEFINE("TIMELINE_4_CO","アイレンズるアニメーション株式会社");
DEFINE("TIMELINE_4_POS","アンドロイド開発者");
DEFINE("TIMELINE_4_YR","2011.11 - 2013.3");
DEFINE("TIMELINE_5_CO","サンミグエル株式会社");
DEFINE("TIMELINE_5_POS","Javaのデスクトップアプリケーション開発者");
DEFINE("TIMELINE_5_YR","2011.7 - 2011.12");
DEFINE("TIMELINE_6_CO","エグズィスト");
DEFINE("TIMELINE_6_POS","アンドロイド開発者");
DEFINE("TIMELINE_6_YR","2010.2 - 2010.9");

DEFINE("SKILLSETS","スキルセット");
DEFINE("MOBILE","モビール");
DEFINE("MOBILE_SET", array("アンドロイド",
							"J2ME",
							"NDK"));
DEFINE("WEB","ウェブ");
DEFINE("WEB_SET", array("WebサービスAPI（RESTfulな）",
							"J2EE",
							"HTML",
							"PHP",
							"CSS"));

























?>